{"help":{"en":{"body":"<h2 id=\"setting-up-a-project\">Setting up a project</h2>\n<p>Every project needs 5 different inputs to calculate accessibility for a region:</p>\n<ol>\n<li><a href=\"#/en/help#administrative-boundaries\">administrative boundaries</a></li>\n<li><a href=\"#/en/help#population-data\">population data</a></li>\n<li><a href=\"#/en/help#points-of-interest\">points of interest</a></li>\n<li><a href=\"#/en/help#road-network\">road network</a></li>\n<li><a href=\"#/en/help#profile\">OSRM profile</a></li>\n</ol>\n<p>These files need to be compatible with each other. This means - for example - that the population data, road network and POI all need to fit within the administrative boundaries, or that the OSRM profile specifies travel speeds for road types that in the road network file.</p>\n<h3 id=\"administrative-boundaries\">Administrative Boundaries</h3>\n<p>The administrative boundaries are the units of analysis for which RRA generates the results. The backend expects a geojson with one or more polygons, which can overlap. The latter is useful to benchmark results for, for example, municipalities against the results of the bigger province.</p>\n<p><strong>File requirements</strong>:</p>\n<ul>\n<li>a geojson file with administrative boundaries</li>\n<li>features need to be a polygon. Anything that&#39;s not a polygon, gets discarded in the current version</li>\n<li>each feature needs a property <code>name</code> (string)</li>\n</ul>\n<p>The administrative boundaries are defined on project level and are available across all its scenarios.</p>\n<h3 id=\"population-data\">Population data</h3>\n<p>The population data is used as the origin in the analysis. These are typically population centers like villages.</p>\n<p><strong>File requirements</strong>:</p>\n<ul>\n<li>a geosjon file with village and population data</li>\n<li>features need to be points</li>\n<li>each feature needs the following properties:<ul>\n<li><code>name</code> (string)</li>\n<li><code>population</code>. This needs to be an integer, or a string that can be parsed into an integer.</li>\n</ul>\n</li>\n</ul>\n<p>The origins are defined on a project level. Each scenario uses the same set of origins.</p>\n<h3 id=\"points-of-interest\">Points of interest</h3>\n<p>The Points of Interest are used as the destination in the analysis.</p>\n<p><strong>File requirements</strong>:</p>\n<ul>\n<li>a single geosjon file with points of interest</li>\n<li>features need to be points</li>\n</ul>\n<p>POI are defined on a project level. Each scenario uses the same set of POI.</p>\n<h3 id=\"road-network\">Road Network</h3>\n<p>The road network needs to be a valid <a href=\"http://wiki.openstreetmap.org/wiki/OSM_XML\">OSM XML</a> file that is routable.</p>\n<p><strong>File requirements</strong>:</p>\n<ul>\n<li>a valid OSM XML file. To speed up the processing, provide a file that only contains the relevant roads.</li>\n</ul>\n<p>A different road network can be uploaded for each scenario.</p>\n<h3 id=\"profile\">Profile</h3>\n<p>The OSRM Profile contains the configuration for the routing, most importantly the speeds per road type.</p>\n<p><strong>File requirements</strong>:</p>\n<ul>\n<li>a lua file with the <a href=\"https://github.com/Project-OSRM/osrm-backend/wiki/Profiles\">OSRM profile</a></li>\n</ul>\n","updatedAt":"2017-05-10T10:14:58.183Z","filename":"en.md"},"eo":{"body":"<p>Tio estas la helpopaĝo.</p>\n","updatedAt":"2017-05-09T15:04:11.026Z","filename":"eo.md"}}}